#################Задание-1###########################
boys = ['Peter', 'Alex', 'John', 'Arthur', 'Richard']
girls = ['Kate', 'Liza', 'Kira', 'Emma', 'Trisha']
boys.sort()
girls.sort()
sep = 'и'
couple = zip (boys, girls)
print('Идеальные пары: ')
if len(boys) == len(girls):
    for boys, girls in couple:
        print (boys, sep, girls)
else:
        print('Количество мальчиков и девочек неодинаково кто тот может остаться без пары')

#################Задание-2###########################
cook_book = [[
    'Салат',
    [
        ['картофель', 100, 'гр.'],
        ['морковь', 50, 'гр.'],
        ['огурцы', 50, 'гр.'],
        ['горошек', 30, 'гр.'],
        ['майонез', 70, 'мл.'],
    ],
],
             [
                 'пицца',
                 [
                     ['сыр', 50, 'гр.'],
                     ['томаты', 50, 'гр.'],
                     ['тесто', 100, 'гр.'],
                     ['бекон', 30, 'гр.'],
                     ['колбаса', 30, 'гр.'],
                     ['грибы', 20, 'гр.'],
                 ],
             ],
             [
                 'фрктовый десерт',
                 [
                     ['хурма', 60, 'гр.'],
                     ['киви', 60, 'гр.'],
                     ['творог', 60, 'гр.'],
                     ['сахар', 10, 'гр.'],
                     ['мед', 50, 'мл.'],
                 ]
             ]]
print('Список покупок: ')
person = int(input('Введите колиство персон:\n'))
for i, recipe in cook_book:
    print(f'{i}:')
    for ingredient, val, measure in recipe:
        print(f'{ingredient}, {val*person} {measure}')